In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
"hello".upper()

'HELLO'

In [3]:
orders = pd.read_table("http://bit.ly/chiporders")

In [4]:
orders.sample(5)

,order_id,quantity,item_name,choice_description,item_price
1350,551,1,Chicken Burrito,"[Tomatillo Green Chili Salsa, Guacamole]",$11.25
3917,1572,1,Chips and Guacamole,NaN,$4.45
1649,667,1,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$8.49
692,285,1,Chips and Tomatillo-Red Chili Salsa,NaN,$2.39
3714,1484,1,Chicken Burrito,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",$8.49

In [6]:
orders.item_name.str.upper().head()

0             CHIPS AND FRESH TOMATO SALSA
1                                     IZZE
2                         NANTUCKET NECTAR
3    CHIPS AND TOMATILLO-GREEN CHILI SALSA
4                             CHICKEN BOWL
Name: item_name, dtype: object

In [10]:
orders[orders.item_name.str.contains("Chicken")]

,order_id,quantity,item_name,choice_description,item_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
...,...,...,...,...,...
4604,1828,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$8.75
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [12]:
orders.choice_description.str.replace("[", "").str.replace("]", "")

<ipython-input-12-db6098d5016f>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  orders.choice_description.str.replace("[", "").str.replace("]", "")

0                                                     NaN
1                                              Clementine
2                                                   Apple
3                                                     NaN
4       Tomatillo-Red Chili Salsa (Hot), Black Beans, ...
                              ...
4617    Fresh Tomato Salsa, Rice, Black Beans, Sour Cr...
4618    Fresh Tomato Salsa, Rice, Sour Cream, Cheese, ...
4619    Fresh Tomato Salsa, Fajita Vegetables, Pinto B...
4620       Fresh Tomato Salsa, Fajita Vegetables, Lettuce
4621    Fresh Tomato Salsa, Fajita Vegetables, Pinto B...
Name: choice_description, Length: 4622, dtype: object

In [13]:
orders.item_name.str.replace("[\[]]", "")

<ipython-input-13-84d2048debf7>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  orders.item_name.str.replace("[\[]]", "")

0                Chips and Fresh Tomato Salsa
1                                        Izze
2                            Nantucket Nectar
3       Chips and Tomatillo-Green Chili Salsa
4                                Chicken Bowl
                        ...
4617                            Steak Burrito
4618                            Steak Burrito
4619                       Chicken Salad Bowl
4620                       Chicken Salad Bowl
4621                       Chicken Salad Bowl
Name: item_name, Length: 4622, dtype: object

In [14]:
from datetime import datetime

In [16]:
current_date = datetime.now() # return date and time
current_date

datetime.datetime(2022, 1, 28, 17, 20, 29, 850743)

In [17]:
current_date.date() # returns date

datetime.date(2022, 1, 28)

In [ ]:
orders.item_name.str.upper().head()

In [22]:
current_date.day # return the day

28

In [23]:
current_date.month # returns month

1

In [24]:
current_date.year #return year

2022

In [25]:
current_date.strftime("%d")

'28'

In [27]:
current_date.strftime("%B")

'January'

In [26]:
current_date.strftime("%b")

'Jan'

In [28]:
current_date.strftime("%D")

'01/28/22'

In [29]:
current_date.strftime("%A")

'Friday'

In [30]:
current_date.strftime("%a")

'Fri'

In [31]:
current_date.strftime("%p")

'PM'

In [32]:
current_date.strftime("%Z")

''

In [37]:
str1 "2021-10-22"
date1 = datetime.strptime(str1,"%Y-%m-%d")

SyntaxError: invalid syntax (<ipython-input-37-1a73c2160953>, line 1)

In [38]:
from datetime import timedelta
import datetime

In [43]:
current_date = datetime.datetime.now()
date_after_10_days = current_date + timedelta(days=10)
date_after_10_days

datetime.datetime(2022, 2, 7, 17, 29, 33, 632839)

In [51]:
df = pd.DataFrame([ ("Foreign Cinema",289.0),
                   ("Liho Liho", 224.0),
                   ("500 Club", 80.5),
                   ("Foreign Cinema", 25.30)],
                 columns=("name", "Amount"))
df

             name  Amount
0  Foreign Cinema   289.0
1       Liho Liho   224.0
2        500 Club    80.5
3  Foreign Cinema    25.3

In [52]:
pd.get_dummies(df,columns=["name"])

   Amount  name_500 Club  name_Foreign Cinema  name_Liho Liho
0   289.0              0                    1               0
1   224.0              0                    0               1
2    80.5              1                    0               0
3    25.3              0                    1               0

In [55]:
pd.get_dummies(df,columns=["name"], prefix="dmy")

   Amount  dmy_500 Club  dmy_Foreign Cinema  dmy_Liho Liho
0   289.0             0                   1              0
1   224.0             0                   0              1
2    80.5             1                   0              0
3    25.3             0                   1              0

In [56]:
pd.get_dummies(df,columns=["name"], prefix="dmy", prefix_sep="*")

   Amount  dmy*500 Club  dmy*Foreign Cinema  dmy*Liho Liho
0   289.0             0                   1              0
1   224.0             0                   0              1
2    80.5             1                   0              0
3    25.3             0                   1              0

In [57]:
pd.get_dummies(df,columns=["name"], drop_first=True)

   Amount  name_Foreign Cinema  name_Liho Liho
0   289.0                    1               0
1   224.0                    0               1
2    80.5                    0               0
3    25.3                    1               0